// ??????? VBA ???????????????????
// ???????: 2026-08-18 23:26:07
// ?????: 编号 | 型号/封装 | 产品名称 | 数量 | 位置 | 备注

const materials = [
  {"编号":"F407-00001","型号/封装":"MCU","产品名称":"STM32F407VET6","数量":"8","位置":"1-2","备注":"无"},
  {"编号":"F407-00002","型号/封装":"MCU","产品名称":"STM32F407ZGT6","数量":"10","位置":"1-5","备注":"无"},
  {"编号":"SN38-00001","型号/封装":"芯片","产品名称":"SN34838","数量":"2","位置":"1-9","备注":"无"},
  {"编号":"SN38-00002","型号/封装":"芯片","产品名称":"SN34838","数量":"2","位置":"2-5","备注":"无"},
  {"编号":"C-00002","型号/封装":"电容","产品名称":"100pf","数量":"0","位置":"3-8","备注":"无"},
  {"编号":"R_001","型号/封装":"电阻","产品名称":"100R %2","数量":"9","位置":"3-7","备注":"无"}
];