// 物料库数据由 VBA 宏自动生成，请勿手动修改
// 生成时间: 2026-10-09 12:17:44
// 表头: 型号 | 数量 | 产品名称 | 位置 | 备注

const materials = [
  {"型号":"#无","数量":"1","产品名称":"螺丝刀","位置":"1"},
  {"型号":"#无","数量":"1","产品名称":"镊子","位置":"2"},
  {"型号":"M1.4x2","数量":"100","产品名称":"螺丝","位置":"3"},
  {"型号":"M2-3H","数量":"100","产品名称":"螺丝-圆头","位置":"4"},
  {"型号":"M1.4-3H","数量":"100","产品名称":"圆头十字螺丝","位置":"5"},
  {"型号":"M2x4H","数量":"100","产品名称":"圆头平垫弹垫螺丝","位置":"6"},
  {"型号":"M1.4-6H","数量":"100","产品名称":"螺丝","位置":"7"},
  {"型号":"M6 M5系列","数量":"20","产品名称":"#无","位置":"8"},
  {"型号":"M3","数量":"100","产品名称":"热熔螺母","位置":"9"},
  {"型号":"M2","数量":"100","产品名称":"热熔螺母","位置":"10"},
  {"型号":"M1.4","数量":"100","产品名称":"贴片螺母","位置":"11"},
  {"型号":"#无","数量":"1","产品名称":"夹子","位置":"12"},
  {"型号":"M2-5H","数量":"20","产品名称":"螺丝-圆头","位置":"13"},
  {"型号":"#无","数量":"100","产品名称":"锉刀","位置":"14"},
  {"型号":"#无","数量":"100","产品名称":"镊子","位置":"15"},
  {"型号":"测试","位置":"150"}
];